CREATE DATABASE  IF NOT EXISTS `travel` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `travel`;
-- MySQL dump 10.13  Distrib 5.7.9, for Win64 (x86_64)
--
-- Host: localhost    Database: travel
-- ------------------------------------------------------
-- Server version	5.7.11-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users` (
  `user` char(20) NOT NULL,
  `password` char(32) NOT NULL,
  `state` int(11) NOT NULL,
  `starttime` bigint(20) DEFAULT NULL,
  `route` mediumtext,
  `prompt` text,
  PRIMARY KEY (`user`),
  UNIQUE KEY `user_UNIQUE` (`user`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES ('a','0cc175b9c0f1b6a831c399e269772661',1,1459065547679,'100,1,310,Q18,400,7,540,Q12,600,8,1030,Q14,1090,7,1280,Q20,1370,1,1560,Q22,1680,4,2270,Q23,2390,1#',NULL),('b','92eb5ffee6ae2fec3ad71c777531578f',1,1459069447442,'180,1,310,Q18,400,7,540,Q12,600,8,790,Q14,850,7,1040,Q20,1130,1,1330,Q00,1350,3,1360,Q02,1380,1,1520,Q16,1640,5,1780,F01,1810,13,2003,F23,2033,11,2240,Q42,2280,12,2490,Q45,2530,11,2540,Q38,2600,3,2800,Q02,2820,1,2950,Q18,3040,7,3200,Q20,3290,1,3480,Q22,3600,4,3710,Q23,3830,1,3910,Q18,4000,7,4220,Q11,4310,2,4450,Q10,4540,7,4640,Q20,4730,1,4930,Q00,4950,3,5080,Q36,5140,6,5330,Q37,5390,3,5440,Q02,5460,1,5600,Q16,5720,5,5830,H10,5870,10,5990,H01,6020,9,6100,Q25,6220,1#','第2天7时0分乘坐Q18从北京出发，第2天16时0分到达郑州，票价90元\n第3天6时0分乘坐Q12从郑州出发，第3天12时0分到达青岛，票价60元\n\n第4天7时0分乘坐Q14从青岛出发，第4天13时0分到达郑州，票价60元\n第5天8时0分乘坐Q20从郑州出发，第5天17时0分到达北京，票价90元\n第6天13时0分乘坐Q00从北京出发，第6天15时0分到达天津，票价10元\n\n第6天16时0分乘坐Q02从天津出发，第6天18时0分到达北京，票价10元\n第7天8时0分乘坐Q16从北京出发，第7天20时0分到达武汉，票价120元\n第8天10时0分乘坐F01从武汉出发，第8天13时0分到达台北，票价900元\n\n第9天8时30分乘坐F23从台北出发，第9天11时30分到达济南，票价900元\n\n第10天8时0分乘坐Q42从济南出发，第10天12时0分到达太原，票价40元\n\n第11天9时0分乘坐Q45从太原出发，第11天13时0分到达济南，票价40元\n第11天14时0分乘坐Q38从济南出发，第11天20时0分到达天津，票价60元\n第12天16时0分乘坐Q02从天津出发，第12天18时0分到达北京，票价10元\n第13天7时0分乘坐Q18从北京出发，第13天16时0分到达郑州，票价90元\n\n第14天8时0分乘坐Q20从郑州出发，第14天17时0分到达北京，票价90元\n第15天12时0分乘坐Q22从北京出发，第16天0时0分到达哈尔滨，票价120元\n\n第16天11时0分乘坐Q23从哈尔滨出发，第16天23时0分到达北京，票价120元\n第17天7时0分乘坐Q18从北京出发，第17天16时0分到达郑州，票价90元\n第18天14时0分乘坐Q11从郑州出发，第18天23时0分到达福州，票价90元\n\n第19天13时0分乘坐Q10从福州出发，第19天22时0分到达郑州，票价90元\n第20天8时0分乘坐Q20从郑州出发，第20天17时0分到达北京，票价90元\n第21天13时0分乘坐Q00从北京出发，第21天15时0分到达天津，票价10元\n第22天4时0分乘坐Q36从天津出发，第22天10时0分到达大连，票价60元\n\n第23天5时0分乘坐Q37从大连出发，第23天11时0分到达天津，票价60元\n第23天16时0分乘坐Q02从天津出发，第23天18时0分到达北京，票价10元\n第24天8时0分乘坐Q16从北京出发，第24天20时0分到达武汉，票价120元\n\n第25天7时0分乘坐H10从武汉出发，第25天11时0分到达西安，票价110元\n\n第25天23时0分乘坐H01从西安出发，第26天2时0分到达长沙，票价90元\n\n第26天10时0分乘坐Q25从长沙出发，第26天22时0分到达北京，票价120元\n\n总票价：3750元'),('c','4a8a08f09d37b73795649038408b5f33',1,1459067666716,'170,2,370,Q10,460,7,540,Q12,600,8,790,Q14,850,7,1040,Q20,1130,1,1330,Q00,1350,3,1480,Q36,1540,6,1580,Q34,1680,11,1790,Q35,1890,6,1990,Q07,2040,4,2220,Q04,2270,6,2300,Q34,2400,11,2480,Q42,2520,12,2730,Q45,2770,11,2780,Q38,2840,3,3040,Q02,3060,1,3190,Q18,3280,7,3440,Q20,3530,1#','第2天13时0分乘坐Q10从福州出发，第2天22时0分到达郑州，票价90元\n第3天6时0分乘坐Q12从郑州出发，第3天12时0分到达青岛，票价60元\n\n第4天7时0分乘坐Q14从青岛出发，第4天13时0分到达郑州，票价60元\n第5天8时0分乘坐Q20从郑州出发，第5天17时0分到达北京，票价90元\n第6天13时0分乘坐Q00从北京出发，第6天15时0分到达天津，票价10元\n第7天4时0分乘坐Q36从天津出发，第7天10时0分到达大连，票价60元\n第7天14时0分乘坐Q34从大连出发，第8天0时0分到达济南，票价100元\n\n第8天11时0分乘坐Q35从济南出发，第8天21时0分到达大连，票价100元\n第9天7时0分乘坐Q07从大连出发，第9天12时0分到达哈尔滨，票价50元\n\n第10天6时0分乘坐Q04从哈尔滨出发，第10天11时0分到达大连，票价50元\n第10天14时0分乘坐Q34从大连出发，第11天0时0分到达济南，票价100元\n第11天8时0分乘坐Q42从济南出发，第11天12时0分到达太原，票价40元\n\n第12天9时0分乘坐Q45从太原出发，第12天13时0分到达济南，票价40元\n第12天14时0分乘坐Q38从济南出发，第12天20时0分到达天津，票价60元\n第13天16时0分乘坐Q02从天津出发，第13天18时0分到达北京，票价10元\n第14天7时0分乘坐Q18从北京出发，第14天16时0分到达郑州，票价90元\n\n第15天8时0分乘坐Q20从郑州出发，第15天17时0分到达北京，票价90元\n\n总票价：1100元'),('d','8277e0910d750195b448797616e091ad',0,1459069239719,'180,4,300,Q04,350,6,380,Q34,480,11,620,Q38,680,3,880,Q02,900,1,1030,Q18,1120,7,1260,Q12,1320,8,1410,H07,1460,10,1620,H09,1660,5,1780,F01,1810,13,2003,F23,2033,11,2060,Q38,2120,3,2230,Q32,2340,10,2510,H10,2550,7,2780,Q11,2870,2,3010,Q10,3100,7,3200,Q20,3290,1#','第2天6时0分乘坐Q04从哈尔滨出发，第2天11时0分到达大连，票价50元\n第2天14时0分乘坐Q34从大连出发，第3天0时0分到达济南，票价100元\n\n第3天14时0分乘坐Q38从济南出发，第3天20时0分到达天津，票价60元\n第4天16时0分乘坐Q02从天津出发，第4天18时0分到达北京，票价10元\n第5天7时0分乘坐Q18从北京出发，第5天16时0分到达郑州，票价90元\n第6天6时0分乘坐Q12从郑州出发，第6天12时0分到达青岛，票价60元\n\n第6天21时0分乘坐H07从青岛出发，第7天2时0分到达西安，票价120元\n第7天18时0分乘坐H09从西安出发，第7天22时0分到达武汉，票价110元\n第8天10时0分乘坐F01从武汉出发，第8天13时0分到达台北，票价900元\n\n第9天8时30分乘坐F23从台北出发，第9天11时30分到达济南，票价900元\n第9天14时0分乘坐Q38从济南出发，第9天20时0分到达天津，票价60元\n\n第10天7时0分乘坐Q32从天津出发，第10天18时0分到达西安，票价110元\n\n第11天11时0分乘坐H10从西安出发，第11天15时0分到达郑州，票价110元\n第12天14时0分乘坐Q11从郑州出发，第12天23时0分到达福州，票价90元\n\n第13天13时0分乘坐Q10从福州出发，第13天22时0分到达郑州，票价90元\n第14天8时0分乘坐Q20从郑州出发，第14天17时0分到达北京，票价90元\n\n总票价：2950元'),('你好','202cb962ac59075b964b07152d234b70',0,NULL,NULL,NULL);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-03-27 19:56:20
